[
  {
    "label": "Co to jest CTF?",
    "content": "CTF, czyli **Capture The Flag**, to ekscytujący konkurs, w którym drużyny stają do rywalizacji, rozwiązując różnorodne zadania z obszaru cyberbezpieczeństwa. Waszym celem będzie odnalezienie ukrytych **flag** – specjalnych ciągów znaków potwierdzających poprawne rozwiązanie. Za każdą zdobytą flagę drużyna otrzymuje punkty, a zwycięzcą zostaje ta, która zgromadzi ich najwięcej!"
  },
  {
    "label": "Czym jest tzw. \"flaga\"?",
    "content": "Flaga to unikalny ciąg znaków, niczym skarb ukryty w zadaniu. Jej odnalezienie jest dowodem na poprawne rozwiązanie problemu. Flagi mają standardowy format: `hack4krakCTF{<tutaj_znajduje_się_flaga>}`."
  },
  {
    "label": "Jak mogę zarejestrować się na wydarzenie?",
    "content": "Aby wziąć udział w konkursie, nauczyciel z Twojej szkoły musi **najpierw zarejestrować drużynę** (maksymalnie 3 drużyny pięcioosobowe na szkołę). Następnie Ty możesz założyć konto na stronie, a następnie dołączyć do swojej drużyny, skanując lub przepisując kod QR, który otrzymasz od nauczyciela."
  },
  {
    "label": "Czy muszę znać się na programowaniu i cyberbezpieczeństwie, żeby wziąć udział w wydarzeniu?",
    "content": "Nie, nie musisz znać się na programowaniu ani cyberbezpieczeństwie! Choć podstawowa wiedza w tych tematach będzie przydatna, do każdego zadania otrzymasz dokumentację naprowadzającą na niezbędne koncepty i ułatwiającą jego wykonanie. Ważna jest kreatywność, współpraca w grupie i inne umiejętności, które pozwolą na rozwiązanie zadań w nieszablonowy sposób."
  },
  {
    "label": "Jakie zadania będą podczas CTF'a?",
    "content": "Zadania będą różne i dostosowane do poziomu uczniów. Będziecie musieli rozwiązywać różne zagadki, szukać wskazówek i wspólnie pracować nad rozwiązaniami. Każde zadanie będzie miało dokumentację, która naprowadzi Was na rozwiązanie i pomoże znaleźć odpowiedzi. Nie wymagana jest duża wiedza informatyczna!"
  },
  {
    "label": "Gdzie mogę poczytać o CTF'ach?",
    "content": "Jeśli chcesz się dodatkowo przygotować przed wydarzeniem, zachęcamy do oglądnięcia [filmu LiveOverflowa](https://www.youtube.com/watch?v=8ev9ZX9J45A), spróbowania trudniejszych zadań na [tryhackme.com](https://tryhackme.com/) oraz [na stronie rehayilmazlar.com](https://rehayilmazlar.com/) oraz do poszukania przeróżnych materiałów i filmów w internecie. Ale nie zrażaj się trudnością zadań, na wydarzeniu będą dostosowane do poziomu uczniów szkół podstawowych :3"
  },
  {
    "label": "Czy podczas wydarzenia mogę korzystać z wyszukiwania informacji w internecie oraz narzędzi AI?",
    "content": "Tak, uczestnicy mogą korzystać z wyszukiwania informacji w internecie oraz narzędzi AI, aby wspierać rozwiązywanie zadań. Pamiętaj jednak, że kluczowe jest samodzielne podejście do wyzwań!"
  },
  {
    "label": "W jaki sposób będą liczone punkty?",
    "content": "Punkty zależą od liczby drużyn, które rozwiążą zadanie: jeśli zadanie rozwiąże jedna lub dwie drużyny, każda z nich otrzymuje 500 punktów. Jeśli zadanie rozwiąże trzy lub więcej drużyn, liczba punktów jest obliczana według wzoru: $500 - (n-2)\\frac{400}{m-2}$, gdzie n to liczba drużyn, które rozwiązały zadanie, a m to łączna liczba zapisanych drużyn. W ten sposób trudniejsze zadania, rozwiązywane przez mniej drużyn, są bardziej premiowane, a łatwiejsze – mniej punktowane. W przypadku, gdy drużyny uzyskają tę samą liczbę punktów, o kolejności drużyn decyduje czas rozwiązania ostatniego zadania przez daną drużynę. Jeśli drużyny uzyskają tę samą liczbę punktów i czas rozwiązania ostatniego zadania, o kolejności drużyn decyduje czas rozwiązania przedostatniego zadania."
  },
  {
    "label": "Czy zapewnione będzie jedzenie i napoje podczas CTF-a?",
    "content": "Tak, podczas wydarzenia będą dostępne przekąski oraz napoje, aby zapewnić uczestnikom komfort i energię w trakcie rywalizacji. Szczegóły dotyczące dostępnych opcji jedzenia podamy wkrótce. Prosimy o zgłoszenie ewentualnych alergii lub preferencji żywieniowych przed wydarzeniem."
  },
  {
    "label": "Jakie nagrody czekają na uczestników CTF-a?",
    "content": "Nagrody będą atrakcyjne i rzeczowe! Przygotowaliśmy dla zwycięzców ciekawe upominki, które z pewnością będą miłą niespodzianką. Szczegóły na temat nagród zostaną ujawnione w trakcie wydarzenia, ale możemy zapewnić, że będą one warte wysiłku i rywalizacji!"
  },
  {
    "label": "Co powinienem przynieść na wydarzenie?",
    "content": "Mile widziane będą własne **laptopy** lub inne sprzęty elektroniczne, na których będziesz rozwiązywać zadania. Organizatorzy zapewnią również sprzęt na miejscu, jednak liczba dostępnych urządzeń jest limitowana. Dodatkowo **obowiązkowo** przynieś <a href=\"/documents/Zgoda_rodzica_lub_opiekuna_prawnego_na_uczestnictwo_w_wydarzeniu.pdf\" target=\"_blank\">zgodę</a> podpisaną przez rodzica lub opiekuna prawnego! Najważniejsze jednak, abyś przyniósł ze sobą dobrą energię, zaangażowanie oraz chęć do rozwiązywania zadań."
  },
  {
    "label": "Kiedy odbędzie się wydarzenie?",
    "content": "Zapisy na wydarzenie są otwarte od 6 maja do 28 maja włącznie, a samo wydarzenie odbędzie się 30 maja."
  },
  {
    "label": "Jak długo będzie trwało wydarzenie?",
    "content": "Wydarzenie odbędzie się w godzinach od 8:00 do15:00. Poniżej przedstawiony jest terminarz wydarzenia: <br/> **8:00–8:30** - Rejestracja uczestników i oficjalne. <br/> **8:30-14:30** - Rozwiązywanie zadań potrwa <br/> **14:30–15:00** - ogłoszenie wyników i wręczenie nagród."
  },
  {
    "label": "Gdzie odbędzie się wydarzenie?",
    "content": "Wydarzenie odbędzie się w budynku XXXI Liceum Ogólnokształcącego w Krakowie, które znajduje się przy ulicy Kazimierza Odnowiciela 2."
  },
  {
    "label": "Czy na miejscu będzie opieka dla uczestników?",
    "content": "Każdy uczestnik musi mieć opiekuna na wydarzeniu, może to być to osoba wyznaczona ze szkoły uczestnika. Dodatkowo, na miejscu obecni będą trzej nauczyciele z XXXI Liceum Ogólnokształcącego, którzy będą nadzorować wydarzenie."
  },
  {
    "label": "Kto może wziąć udział w wydarzeniu?",
    "content": "W tej edycji Hack4Krak udział mogą wziąć tylko uczniowie klas 7 i 8 szkół podstawowych w Krakowie, w maksymalnie 5-osobowych grupach. Każda szkoła może zarejestrować maksymalnie 3 drużyny."
  },
  {
    "label": "Kto jest organizatorem wydarzenia?",
    "content": "Organizatorem wydarzenia jest XXXI Liceum Ogólnokształcące w Krakowie, przy wsparciu Samorządu Uczniowskiego oraz zespołu organizacyjnego Hack4Krak."
  },
  {
    "label": "Jak mogę skontaktować się z organizatorami?",
    "content": "W razie pytań zapraszamy do kontaktu: E-mail organizatorów: kontakt@hack4krak.pl, Koordynator główny: Jakub Starzyk — jakub.starzyk@lo31.krakow.pl tel. +48 571 493 707, Opiekun ze strony rady pedagogicznej: Anna Ligas-Kowaluk — aligaskowaluk@lo31.krakow.pl"
  },
  {
    "label": "Jak wygląda kwestia RODO?",
    "content": "Administratorem danych jest XXXI Liceum Ogólnokształcące w Krakowie. Zgody RODO oraz zgody na uczestnictwo podpisują rodzice uczniów, a uczniowie muszą dostarczyć je organizatorom w dniu wydarzenia. Więcej informacji znajduje się w [Polityce prywatności](/docs/privacy-policy)."
  }
]
