[
  {
    "label": "Co to jest CTF?",
    "content": "CTF, czyli \"Capture The Flag\", to konkurs, w którym drużyny rywalizują, rozwiązując zadania z różnych dziedzin cyberbezpieczeństwa. Ich celem jest odnalezienie tzw. \"flag\" — specjalnych ciągów znaków, które potwierdzają poprawność rozwiązania. Każda zdobyta flaga przyznaje punkty, a ostatecznym celem drużyn jest zgromadzenie jak największej liczby punktów i zdobycie jak najwyższego miejsca w rankingu na koniec wydarzenia."
  },
  {
    "label": "Czym jest tzw. \"flaga\"?",
    "content": "Flaga to specjalny ciąg znaków ukryty w zadaniu, który służy jako potwierdzenie jego poprawnego wykonania. Zadaniem uczestników jest odnalezienie tej flagi. Flagi zapisane są w formacie: hack4krak{flaga}."
  },
  {
    "label": "Kto może wziąć udział w wydarzeniu?",
    "content": "Uczniowie klas 7 i 8 szkół podstawowych, w maksymalnie 5-osobowych grupach. Na każdą szkołę przypadają maksymalnie 3 drużyny."
  },
  {
    "label": "Czy muszę znać się na programowaniu i cyberbezpieczeństwie, żeby wziąć udział w wydarzeniu?",
    "content": "Nie, nie musisz znać się na programowaniu ani cyberbezpieczeństwie, oczywiście podstawowa wiedza w tych tematach będzie przydatna, natomiast do każdego zadania zostanie dołączona dokumentacja, która ułatwi jego wykonanie, poprzez naprowadzenie na koncepty do tego potrzebne."
  },
  {
    "label": "Czy podczas wydarzenia mogę korzystać z wyszukiwania informacji w internecie oraz narzędzi AI??",
    "content": "Tak, uczestnicy mogą korzystać z wyszukiwania informacji w internecie oraz narzędzi AI, aby wspierać rozwiązywanie zadań. Pamiętaj jednak, że kluczowe jest samodzielne podejście do wyzwań!"
  },
  {
    "label": "Co powinienem przynieść na wydarzenie?",
    "content": "Zachęcamy uczestników do przyniesienia własnych laptopów. Organizatorzy zapewnią również sprzęt na miejscu, jednak liczba dostępnych urządzeń jest ograniczona i może nie wystarczyć dla wszystkich uczestników. Najważniejsze jednak, aby uczniowie przynieśli ze sobą dobrą energię, zaangażowanie oraz chęć do rozwiązywania zadań."
  },
  {
    "label": "Kiedy odbędzie się wydarzenie?",
    "content": "Zapisy na wydarzenie są otwarte od 1 maja do 23 maja włącznie, a samo wydarzenie odbędzie się 30 maja."
  },
  {
    "label": "Jak długo będzie trwało wydarzenie?",
    "content": "Wydarzenie odbędzie się w godzinach 8:00–15:00. Rejestracja uczestników rozpocznie się o godzinie 8:00. Czas przeznaczony na rozwiązywanie zadań potrwa od 9:00 do 14:30."
  },
  {
    "label": "Gdzie odbędzie się wydarzenie?",
    "content": "Wydarzenie odbędzie się w budynku XXXI Liceum Ogólnokształcącego w Krakowie, które znajduje się przy ulicy Kazimierza Odnowiciela 2."
  },
  {
    "label": "Czy na miejscu będzie opieka dla uczestników?",
    "content": "Z każdej szkoły biorącej udział musi przyjść co najmniej jeden nauczyciel, który będzie pełnił rolę opiekuna uczniów. Dodatkowo, na miejscu obecni będą trzej nauczyciele z XXXI Liceum Ogólnokształcącego, którzy będą nadzorować wydarzenie."
  },
  {
    "label": "Kto jest organizatorem wydarzenia?",
    "content": "Organizatorem wydarzenia jest Samorząd Uczniowski XXXI LO, przy wsparciu członków Rady Pedagogicznej."
  },
  {
    "label": "Jak mogę skontaktować się z organizatorami?",
    "content": "W razie pytań zapraszamy do kontaktu: E-mail organizatorów: hack4krak@gmail.com, Koordynator główny: Jakub Starzyk — jakub.starzyk@lo31.krakow.pl tel. +48 571 493 707, Opiekun ze strony rady pedagogicznej: Anna Ligas-Kowaluk — aligaskowaluk@lo31.krakow.pl"
  },
  {
    "label": "Jak mogę zarejestrować się na wydarzenie?",
    "content": "Aby wziąć udział w konkursie, każdy uczestnik musi się zarejestrować indywidualnie. Jednakże, aby ostatecznie wziąć udział w konkursie, nauczyciel musi zarejestrować drużyny. Po zarejestrowaniu drużyn, możesz dopisać się do jednej z nich."
  },
  {
    "label": "Jak wygląda kwestia RODO?",
    "content": "RODO zostało uzgodnione z inspektorem RODO XXXI LO. Zgody RODO oraz zgody na uczestnictwo podpisują rodzice uczniów, a uczniowie muszą dostarczyć je organizatorom w dniu wydarzenia."
  }
]
