[
  {
    "label": "Na czym polega \"lokalny CTF\"?",
    "content": "Lokalny CTF to zawody z cyberbezpieczeństwa, które będą się składały z dwóch części: pierwsza to pilotażowy CTF, tylko dla uczniów 31 LO, a druga to główne zawody, otwarte dla wszystkich uczniów szkół średnich w Krakowie. Głównym zadaniem uczestników będzie rozwiązywanie różnych zadań związanych z bezpieczeństwem komputerowym, przełamywaniem zabezpieczeń oraz kryptografią., żeby zdobyć tzw. \"flagę\"."
  },
  {
    "label": "Kto organizuje te zawody w Krakowie?",
    "content": "Zawody organizują uczniowie 31 LO w Krakowie, którzy znają się na cyberbezpieczeństwie i chcą podzielić się tym z innymi."
  },
  {
    "label": "Kto może wziąć udział w zawodach?",
    "content": "Pierwsza część (pilotażowa) jest tylko dla uczniów 31 LO, ale druga część to zawody otwarte dla wszystkich uczniów szkół średnich w Krakowie i okolic. Można się zapisać indywidualnie lub w drużynie."
  },
  {
    "label": "Jak mogę się zarejestrować?",
    "content": "Wystarczy zalogować się na stronie, stworzyć drużynę i już!"
  },
  {
    "label": "Gdzie odbędą się zawody?",
    "content": "Część pilotażowa odbędzie się w 31 LO w Krakowie, natomiast lokalizacja głównych zawodów zostanie jeszcze określona."
  },
  {
    "label": "Jak mogę skontaktować się z organizatorami w razie pytań?",
    "content": "Możesz zadać pytanie przez serwer Discord (link w nagłówku strony) lub napisać maila na adres: hack4krak@gmail.com."
  },
  {
    "label": "Czy korzystanie ze sztucznej inteligencji, w tym filmów na YouTube i innych narzędzi AI, jest dozwolone?",
    "content": "Oczywiście, można używać AI, filmów na YouTube i innych źródeł w trakcie zawodów. Możesz korzystać z nich, aby szukać wskazówek, analizować zadania czy korzystać z narzędzi, które pomogą ci rozwiązać problemy."
  },
  {
    "label": "Czy muszę znać się na programowaniu i cyberbezpieczeństwie, żeby wziąć udział w zawodach?",
    "content": "Nie, nie musisz znać się na programowaniu ani cyberbezpieczeńśtwe, oczywiście podstawowa wiedza w tych tematach będzie przydatna, natomiast do każdego zadania zostanie dołączona dokumentacja, która ułatwi jego wykonanie, poprzez naprowadzenie na koncepty do tego potrzebne."
  },
  {
    "label": "Czym jest flaga?",
    "content": "Flaga to ciąg znaków, który jest ukryty w zadaniu. Zadaniem uczestników jest odnalezienie tej flagi, która zapisana jest w formacie: hack4krak{flaga}."
  }
]
